In [3]:
#Importing libraries
import pandas as pd

In [4]:
#Loading data
data = pd.read_csv("mode_mean.csv")

In [5]:
#Printing first 5 rows
data.head()

   Student  Overall Marks Gender    Subject
0    Anish             97   Male    English
1  Rishabh             83   Male    English
2     Ajay             78   Male    Physics
3  Abhinav             86   Male  Chemistry
4   Anurag             91   Male    English

In [6]:
#Calculating mean
mean_data = data['Overall Marks'].mean()

In [7]:
#Printing mean
print(mean_data)

68.21

In [8]:
#Added a value 10000 at the bottom of the file and save it as mean_robust.csv
data_new= pd.read_csv("mean_robust.csv")

In [11]:
data_new.tail()

    Student  Overall Marks  Gender    Subject
96    vivek             55    Male    Physics
97    Tisha              7  Female    English
98   Raghav             73    Male    English
99   Ishita             82  Female  Chemistry
100     NaN          10000     NaN        NaN

In [9]:
mean_data_new = data_new['Overall Marks'].mean()

In [10]:
mean_data_new

166.54455445544554